bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51J18A.atdf
        <register name="CHINTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="TERR" caption="Channel Transfer Error" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend" mask="0x4"/>
        </register>
        <register name="CHSTATUS" offset="0xF" rw="RW" size="1" initval="0x00" caption="Channel n Status">
          <bitfield name="PEND" caption="Channel Pending" mask="0x1"/>
          <bitfield name="BUSY" caption="Channel Busy" mask="0x2"/>
          <bitfield name="FERR" caption="Channel Fetch Error" mask="0x4"/>
          <bitfield name="CRCERR" caption="Channel CRC Error" mask="0x8"/>
        </register>
      </register-group>
      <register-group name="DMAC" caption="Direct Memory Access Controller">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="DMAC_CRCCTRL__CRCBEATSIZE"/>
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="DMAC_CRCCTRL__CRCPOLY"/>
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="DMAC_CRCCTRL__CRCSRC"/>
          <bitfield name="CRCMODE" caption="CRC Operating Mode" mask="0xC000" values="DMAC_CRCCTRL__CRCMODE"/>
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
          <bitfield name="CRCERR" caption="CRC Error" mask="0x4"/>
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
          <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4"/>
          <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8"/>
          <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10"/>
          <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20"/>
          <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40"/>
          <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80"/>
          <bitfield name="SWTRIG8" caption="Channel 8 Software Trigger" mask="0x100"/>
          <bitfield name="SWTRIG9" caption="Channel 9 Software Trigger" mask="0x200"/>
          <bitfield name="SWTRIG10" caption="Channel 10 Software Trigger" mask="0x400"/>
          <bitfield name="SWTRIG11" caption="Channel 11 Software Trigger" mask="0x800"/>
          <bitfield name="SWTRIG12" caption="Channel 12 Software Trigger" mask="0x1000"/>
          <bitfield name="SWTRIG13" caption="Channel 13 Software Trigger" mask="0x2000"/>
          <bitfield name="SWTRIG14" caption="Channel 14 Software Trigger" mask="0x4000"/>
          <bitfield name="SWTRIG15" caption="Channel 15 Software Trigger" mask="0x8000"/>
          <bitfield name="SWTRIG16" caption="Channel 16 Software Trigger" mask="0x10000"/>
          <bitfield name="SWTRIG17" caption="Channel 17 Software Trigger" mask="0x20000"/>
          <bitfield name="SWTRIG18" caption="Channel 18 Software Trigger" mask="0x40000"/>
          <bitfield name="SWTRIG19" caption="Channel 19 Software Trigger" mask="0x80000"/>
          <bitfield name="SWTRIG20" caption="Channel 20 Software Trigger" mask="0x100000"/>
          <bitfield name="SWTRIG21" caption="Channel 21 Software Trigger" mask="0x200000"/>
          <bitfield name="SWTRIG22" caption="Channel 22 Software Trigger" mask="0x400000"/>
          <bitfield name="SWTRIG23" caption="Channel 23 Software Trigger" mask="0x800000"/>
          <bitfield name="SWTRIG24" caption="Channel 24 Software Trigger" mask="0x1000000"/>
          <bitfield name="SWTRIG25" caption="Channel 25 Software Trigger" mask="0x2000000"/>
          <bitfield name="SWTRIG26" caption="Channel 26 Software Trigger" mask="0x4000000"/>
          <bitfield name="SWTRIG27" caption="Channel 27 Software Trigger" mask="0x8000000"/>
          <bitfield name="SWTRIG28" caption="Channel 28 Software Trigger" mask="0x10000000"/>
          <bitfield name="SWTRIG29" caption="Channel 29 Software Trigger" mask="0x20000000"/>
          <bitfield name="SWTRIG30" caption="Channel 30 Software Trigger" mask="0x40000000"/>
          <bitfield name="SWTRIG31" caption="Channel 31 Software Trigger" mask="0x80000000"/>
        </register>
